In [1]:
# Aula 02 - Configuração de ambiente Python

In [2]:
print('Inteligencia Artificial e Big Data - aula 02')

Inteligencia Artificial e Big Data - aula 02

In [ ]:
# instalação biblioteca pandas
!pip install pandas

In [4]:
# importar a biblioteca pandas
import pandas as pd

In [5]:
# Criando um dicionario no Python

Dicionario = {
    'A': [1,2,3],
    'B':[-3,-2,-1],
    'C':[0,10,20]
}

# Criando um index para linhas do dicionario
Label = ['1ª Linha','2ª Linha','3ª Linha']

# Criar o Dataframe
Dataframe_01 = pd.DataFrame(Dicionario,index=Label)
print(Dataframe_01)

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [6]:
# Selecionando colunas A e B
Dataframe_01[['A','B']]

          A  B
1ª Linha  1 -3
2ª Linha  2 -2
3ª Linha  3 -1

In [7]:
# Selecionando as colunas A e C
Dataframe_01[['A','C']]

          A   C
1ª Linha  1   0
2ª Linha  2  10
3ª Linha  3  20

In [8]:
# Criando uma nova coluna no Dataframe
Dataframe_01['Nova coluna'] = Dataframe_01['A']*Dataframe_01['B']

In [9]:
# Exibindo o Dataframe
Dataframe_01

          A  B   C  Nova coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [12]:
# Exibindo mais de um valor na celula do Jupyter notebook
a =5
print(a)
Dataframe_01

5

          A  B   C  Nova coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [13]:
# Excluindo uma coluna do Dataframe
Dataframe_01.drop('Nova coluna',axis=1) # drop exclui a coluna do
# Dataframe

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [ ]:
Dataframe_01.drop('1ª Linha',axis=0) # drop exclui a linha  do
# Dataframe

          A  B   C  Nova coluna
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [17]:
Dataframe_01

          A  B   C  Nova coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [18]:
# Excluindo uma coluna do Dataframe de forma permanente
Dataframe_01.drop('Nova coluna',axis=1,inplace=True) # drop exclui a coluna do
# Dataframe

In [19]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [20]:
# Localizando uma linha no Dataframe
Dataframe_01.loc['1ª Linha'] #localiza uma linha do Dataframe

A    1
B   -3
C    0
Name: 1ª Linha, dtype: int64

In [21]:
# Localizando uma linha no Dataframe
Dataframe_01.loc['2ª Linha']

A     2
B    -2
C    10
Name: 2ª Linha, dtype: int64

In [24]:
# Localizando uma linha no Dataframe
Dataframe_01.loc['3ª Linha']

A     3
B    -1
C    20
Name: 3ª Linha, dtype: int64

In [27]:
# Localizando linha e coluna
Dataframe_01.loc[['1ª Linha','2ª Linha'],['A','B']]

          A  B
1ª Linha  1 -3
2ª Linha  2 -2

In [ ]:
Dataframe_01.head() # mostra as 4 primeiras linhas do Dataframe

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [ ]:
Dataframe_01.tail() # Mostra as 4 ultimas linhas do Dataframe

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [33]:
# Localizando linhas pelo indice numerico
Dataframe_01.iloc[2:3,1:] # Linha, coluna

          B   C
3ª Linha -1  20

In [34]:
# Localizando linhas pelo indice numerico
Dataframe_01.iloc[2:3] # Linha, coluna

          A  B   C
3ª Linha  3 -1  20

In [45]:
# Localizando linhas pelo indice numerico
Dataframe_01.iloc[:,2] # Linha, coluna

1ª Linha     0
2ª Linha    10
3ª Linha    20
Name: C, dtype: int64

In [46]:
# Criando filtro condicional no Dataframe
Filtro = Dataframe_01['C']>0 # Armazena o resultado na variavel filtro
Dataframe_02 = Dataframe_01[Filtro]

In [47]:
Dataframe_02

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [ ]:
Dataframe_01>0 # retornar onde os numero sao maior que 0

             A      B      C
1ª Linha  True  False  False
2ª Linha  True  False   True
3ª Linha  True  False   True

In [49]:
Filtro

1ª Linha    False
2ª Linha     True
3ª Linha     True
Name: C, dtype: bool

In [50]:
# Criando filtro de duas colunas
Dataframe_01[(Dataframe_01['A']>1)& (Dataframe_01['C']>0)]

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [53]:
# Criando filtro de duas colunas com a logica or
Dataframe_01[(Dataframe_01['A']>5)| (Dataframe_01['C']>2)]

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [54]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [55]:
# Resetando o index do Dataframe
Dataframe_01.reset_index()

      index  A  B   C
0  1ª Linha  1 -3   0
1  2ª Linha  2 -2  10
2  3ª Linha  3 -1  20

In [56]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [ ]:
# Resetando o index do Dataframe de forma definitiva
Dataframe_01.reset_index(inplace= True) # reseta o index na base de dados original

In [58]:
Dataframe_01

      index  A  B   C
0  1ª Linha  1 -3   0
1  2ª Linha  2 -2  10
2  3ª Linha  3 -1  20

In [59]:
# Excluindo a coluna do index
Dataframe_01.drop('index',axis=1,inplace= True)

In [60]:
Dataframe_01

   A  B   C
0  1 -3   0
1  2 -2  10
2  3 -1  20

In [61]:
#Criando varios dicionarios

Dicionario_01a = {
    'A': [1,2,3],
    'B':[-32,-21,-15],
    'C':[60,10,20],
    'Chave':['AA','BB','CC']
}

#Dicionario 02 
Dicionario_02 = {
    'A':[6,7,8],
    'B':[-39,-28,-17],
    'C':[1000,10,60],
    'Chave':['AA','BB','CC']
}

# Dicionario 03
Dicionario_03 ={
    'A':[11,12,13],
    'B':[-39,-22,-11],
    'C':[30,10,20],
    'Chave':['AA','BB','CC']
}
# Criando as listas para serem os labels
Label_01 = ['1ª Linha','2ª Linha','3ª Linha']
Label_02 = ['4ª Linha','5ª Linha','6ª Linha']
Label_03 =['7ª Linha','8ª Linha','9ª Linha']

# Criando os dataframes
Dataframe_01n = pd.DataFrame(Dicionario_01a,index=Label_01)
Dataframe_02n = pd.DataFrame(Dicionario_02,index=Label_02)
Dataframe_03 = pd.DataFrame(Dicionario_03,index=Label_03)

In [62]:
Dataframe_01n

          A   B   C Chave
1ª Linha  1 -32  60    AA
2ª Linha  2 -21  10    BB
3ª Linha  3 -15  20    CC

In [63]:
Dataframe_02n

          A   B     C Chave
4ª Linha  6 -39  1000    AA
5ª Linha  7 -28    10    BB
6ª Linha  8 -17    60    CC

In [65]:
Dataframe_03

           A   B   C Chave
7ª Linha  11 -39  30    AA
8ª Linha  12 -22  10    BB
9ª Linha  13 -11  20    CC

In [66]:
# Juntando os dataframes com concat
# empilhando os dataframes
pd.concat([Dataframe_01n,Dataframe_02n,Dataframe_03])

           A   B     C Chave
1ª Linha   1 -32    60    AA
2ª Linha   2 -21    10    BB
3ª Linha   3 -15    20    CC
4ª Linha   6 -39  1000    AA
5ª Linha   7 -28    10    BB
6ª Linha   8 -17    60    CC
7ª Linha  11 -39    30    AA
8ª Linha  12 -22    10    BB
9ª Linha  13 -11    20    CC

In [67]:
# Juntando Dataframe com merge

pd.merge(Dataframe_01n,Dataframe_02n,how='inner',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [69]:
# Juntando Dataframe com merge

pd.merge(Dataframe_01n,Dataframe_03,how='left',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20

In [70]:
print(Dataframe_01n)
print(Dataframe_03)

          A   B   C Chave
1ª Linha  1 -32  60    AA
2ª Linha  2 -21  10    BB
3ª Linha  3 -15  20    CC
           A   B   C Chave
7ª Linha  11 -39  30    AA
8ª Linha  12 -22  10    BB
9ª Linha  13 -11  20    CC

In [71]:
# Juntando Dataframe com merge

pd.merge(Dataframe_01n,Dataframe_03,how='right',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20

In [72]:
# Juntando Dataframe com merge

pd.merge(Dataframe_01n,Dataframe_02n,how='outer',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [73]:
 # Juntando Dataframe utilizando o join
dic1 = {
    'A':[1,2,3],
    'B':[-32,-21,-15],
    'C':[60,10,20]
}

dic2={
    'D':[6,7,8],
    'E':[-39,-28,-27],
    'F':[1000,10,60]
}

# Criando o label

Label_01a = ['1ª Linha','2ª Linha','3ª Linha']

# Estruturando o Dataframe 
df01 = pd.DataFrame(dic1,index= Label_01a)
df02 = pd.DataFrame(dic2,index= Label_01a)

In [74]:
df01

          A   B   C
1ª Linha  1 -32  60
2ª Linha  2 -21  10
3ª Linha  3 -15  20

In [75]:
df02

          D   E     F
1ª Linha  6 -39  1000
2ª Linha  7 -28    10
3ª Linha  8 -27    60

In [76]:
df01.join(df02) # juntando dataframe com join

          A   B   C  D   E     F
1ª Linha  1 -32  60  6 -39  1000
2ª Linha  2 -21  10  7 -28    10
3ª Linha  3 -15  20  8 -27    60